src/Catalogs/Addresses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Addresses</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Companies</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>FirstName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MiddleName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LastName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Fax</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLine1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLine2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>City</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.States</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Country</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Countries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ZIP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultBilling</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultShipping</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RemitTo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/WebServices/companiesgetcode/Ext/Module.bsl
Function inout(jsonin)
	
	ParsedJSON = InternetConnectionClientServer.DecodeJSON(jsonin);
	
	Company = Catalogs.Companies.FindByCode(ParsedJSON.object_code);
	
	Query = New Query("SELECT
	                  |	Addresses.Description,
	                  |	Addresses.FirstName,
	                  |	Addresses.LastName,
	                  |	Addresses.DefaultBilling,
	                  |	Addresses.DefaultShipping,
	                  |	Addresses.Code,
	                  |	Addresses.MiddleName,
	                  |	Addresses.Phone,
	                  |	Addresses.Email,
	                  |	Addresses.AddressLine1,
	                  |	Addresses.AddressLine2,
	                  |	Addresses.City,
	                  |	Addresses.State,
	                  |	Addresses.Country,
	                  |	Addresses.ZIP
	                  |FROM
	                  |	Catalog.Addresses AS Addresses
	                  |WHERE
	                  |	Addresses.Owner = &Company");
	Query.SetParameter("Company", Company);
	Result = Query.Execute().Choose();
	
	Addresses = New Array();
	
	While Result.Next() Do
		
		Address = New Map();
		Address.Insert("address_id", Result.Description);
		Address.Insert("address_code", Result.Code);
		Address.Insert("first_name", Result.FirstName);
		Address.Insert("middle_name", Result.MiddleName);
		Address.Insert("last_name", Result.LastName);
		Address.Insert("phone", Result.Phone);
		Address.Insert("email", Result.Email);
		Address.Insert("address_line1", Result.AddressLine1);
		Address.Insert("address_line2", Result.AddressLine2);
		Address.Insert("city", Result.City);
		Address.Insert("zip", Result.ZIP);
		Address.Insert("state", Result.State.Code);
		Address.Insert("country", Result.Country.Description);
		Address.Insert("default_billing", Result.DefaultBilling);
		Address.Insert("default_shipping", Result.DefaultShipping);
		
		Addresses.Add(Address);
		
	EndDo;
	
	DataAddresses = New Map();
	DataAddresses.Insert("addresses", Addresses);
	
	CompanyData = New Map();
	CompanyData.Insert("company_name", Company.Description);
	CompanyData.Insert("company_code", Company.Code);
	CompanyData.Insert("company_type", "customer");
	CompanyData.Insert("lines", DataAddresses);
	
	jsonout = InternetConnectionClientServer.EncodeJSON(CompanyData,,True,True);                    
	
	Return jsonout;

EndFunction
